programming/c/tools/nm.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>nm(1)</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">nm(1)</h1>
<p>
<code>nm - list symbols from object files</code>
</p>

<pre class="example">
address / type / symbol name

addresses are placeholders in object files, and final in
executables. (0000000000000000)

T text. name of symbols (functions or variables)
U undefined.  referenced or used in this object code/executable, but
it’s value wasn’t defined here

- this can be used to get a list of all functions used in a file

$ nm foo.o
                 U fgets
0000000000000000 T main
                 U printf
                 U stdin
</pre>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
